amendozag88/STM32N6-GettingStarted-PoseEstimation/Application/STM32N6570-DK/Src/main.c
  return (xi != *x) || (yi != *y);
}

static void convert_length(float32_t wi, float32_t hi, int *wo, int *ho)
{
  *wo = lcd_bg_area.XSize * wi;
  *ho = lcd_bg_area.YSize * hi;
}

static void convert_point(float32_t xi, float32_t yi, int *xo, int *yo)
{
  *xo = lcd_bg_area.XSize * xi + lcd_bg_area.X0;
  *yo = lcd_bg_area.YSize * yi + lcd_bg_area.Y0;
}

static void Display_binding_line(int x0, int y0, int x1, int y1, uint32_t color)
{
  clamp_point(&x0, &y0);
  clamp_point(&x1, &y1);

  UTIL_LCD_DrawLine(x0, y0, x1, y1, color);
}

/**
* @brief Display Neural Network output classification results as well as other performances informations
*
* @param p_postprocess pointer to postprocessing output
* @param inference_ms inference time in ms
*/
static void Display_NetworkOutput(void *p_postprocess, uint32_t inference_ms)
{
#if POSTPROCESS_TYPE == POSTPROCESS_MPE_YOLO_V8_UF
  mpe_pp_outBuffer_t *rois = ((mpe_pp_out_t *) p_postprocess)->pOutBuff;
  uint32_t nb_rois = ((mpe_pp_out_t *) p_postprocess)->nb_detect;
#elif POSTPROCESS_TYPE == POSTPROCESS_SPE_MOVENET_UF
  spe_pp_outBuffer_t *roi = ((spe_pp_out_t *) p_postprocess)->pOutBuff;
#endif
  int ret;

  ret = HAL_LTDC_SetAddress_NoReload(&hlcd_ltdc, (uint32_t) lcd_fg_buffer[lcd_fg_buffer_rd_idx], LTDC_LAYER_2);
  assert(ret == HAL_OK);

  /* Draw bounding boxes */
  UTIL_LCD_FillRect(lcd_fg_area.X0, lcd_fg_area.Y0, lcd_fg_area.XSize, lcd_fg_area.YSize, 0x00000000); /* Clear previous boxes */
#if POSTPROCESS_TYPE == POSTPROCESS_MPE_YOLO_V8_UF
  for (int i = 0; i < nb_rois; i++)
    Display_mpe_Detection(&rois[i]);
  UTIL_LCDEx_PrintfAt(0, LINE(2), CENTER_MODE, "Objects %u", nb_rois);
#elif POSTPROCESS_TYPE == POSTPROCESS_SPE_MOVENET_UF
  Display_spe_Detection(roi);
#endif

  // *** GESTURE DISPLAY AND DEBUGGING ***
  GestureType_t current_gesture = Gesture_GetCurrentDisplayGesture(&gesture_detector);
  // To save the current gesture

  UTIL_LCD_SetBackColor(0x40000000);
  UTIL_LCDEx_PrintfAt(0, LINE(19), CENTER_MODE, "Inference: %ums", inference_ms);
  //UTIL_LCDEx_PrintfAt(0, LINE(18), CENTER_MODE, "STM32 Edge AI Contest");

  // Gesture detection result
   if (current_gesture != GESTURE_NONE) {
     UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_YELLOW); // Highlight detected gesture
     UTIL_LCDEx_PrintfAt(0, LINE(16), CENTER_MODE, "GESTURE: %s", Gesture_GetName(current_gesture));
     UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE);  // Reset to white
   } else {
     UTIL_LCDEx_PrintfAt(0, LINE(16), CENTER_MODE, "Gesture: %s", Gesture_GetName(current_gesture));
   }

  //Debug the head postiion
  float32_t  x_coord=roi[0].x_center;
  float32_t  y_coord=roi[0].y_center;
  float32_t confidence = roi[0].proba;
  UTIL_LCDEx_PrintfAt(0, LINE(20), CENTER_MODE, "X: %f, Y: %f P:%f", x_coord,y_coord, confidence	  );
  //Check if gesture_detector is being updated correctly
  UTIL_LCDEx_PrintfAt(0, LINE(20), CENTER_MODE, "X: %f, Y: %f P:%f", x_coord,y_coord, confidence	  );

  //End of debug head position

  UTIL_LCD_SetBackColor(0);
  Display_WelcomeScreen();

  SCB_CleanDCache_by_Addr(lcd_fg_buffer[lcd_fg_buffer_rd_idx], LCD_FG_FRAMEBUFFER_SIZE);
  ret = HAL_LTDC_ReloadLayer(&hlcd_ltdc, LTDC_RELOAD_VERTICAL_BLANKING, LTDC_LAYER_2);
  assert(ret == HAL_OK);
  lcd_fg_buffer_rd_idx = 1 - lcd_fg_buffer_rd_idx;
}

static void LCD_init(void)
{
  BSP_LCD_Init(0, LCD_ORIENTATION_LANDSCAPE);

  /* Preview layer Init */
  LayerConfig.X0          = lcd_bg_area.X0;
  LayerConfig.Y0          = lcd_bg_area.Y0;
  LayerConfig.X1          = lcd_bg_area.X0 + lcd_bg_area.XSize;
  LayerConfig.Y1          = lcd_bg_area.Y0 + lcd_bg_area.YSize;
  LayerConfig.PixelFormat = LCD_PIXEL_FORMAT_RGB565;
  LayerConfig.Address     = (uint32_t) lcd_bg_buffer;

  BSP_LCD_ConfigLayer(0, LTDC_LAYER_1, &LayerConfig);

  LayerConfig.X0 = lcd_fg_area.X0;
  LayerConfig.Y0 = lcd_fg_area.Y0;
  LayerConfig.X1 = lcd_fg_area.X0 + lcd_fg_area.XSize;
  LayerConfig.Y1 = lcd_fg_area.Y0 + lcd_fg_area.YSize;
  LayerConfig.PixelFormat = LCD_PIXEL_FORMAT_ARGB4444;
  LayerConfig.Address = (uint32_t) lcd_fg_buffer; /* External XSPI1 PSRAM */

  BSP_LCD_ConfigLayer(0, LTDC_LAYER_2, &LayerConfig);
  UTIL_LCD_SetFuncDriver(&LCD_Driver);
  UTIL_LCD_SetLayer(LTDC_LAYER_2);
  UTIL_LCD_Clear(0x00000000);
  UTIL_LCD_SetFont(&Font20);
  UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE);

#if POSTPROCESS_TYPE == POSTPROCESS_MPE_YOLO_V8_UF
  Display_mpe_InitFunctions(clamp_point,
                            convert_length,
                            convert_point,
                            Display_binding_line);
#elif POSTPROCESS_TYPE == POSTPROCESS_SPE_MOVENET_UF
  Display_spe_InitFunctions(clamp_point,
                            convert_length,
                            convert_point,
                            Display_binding_line);
#endif
}


static void Display_GameAndPoseInfo(void *p_postprocess, uint32_t inference_ms)
{
    spe_pp_outBuffer_t *roi = ((spe_pp_out_t *) p_postprocess)->pOutBuff;
    int ret;

    // Set up LCD layer for overlay graphics
    ret = HAL_LTDC_SetAddress_NoReload(&hlcd_ltdc, (uint32_t) lcd_fg_buffer[lcd_fg_buffer_rd_idx], LTDC_LAYER_2);
    assert(ret == HAL_OK);

    /* Clear overlay layer */
    UTIL_LCD_FillRect(lcd_fg_area.X0, lcd_fg_area.Y0, lcd_fg_area.XSize, lcd_fg_area.YSize, 0x00000000);

    // Draw pose keypoints for debugging/feedback (optional)
    #ifndef HIDE_POSE_OVERLAY
    Display_spe_Detection(roi);
    #endif

    // Show inference performance in a corner (smaller text)
    UTIL_LCD_SetBackColor(0x40000000);
    UTIL_LCD_SetFont(&Font16); // Smaller font
    UTIL_LCDEx_PrintfAt(650, LINE(20), LEFT_MODE, "AI: %ums", inference_ms);

    // Show gesture detection result
    GestureType_t current_gesture = Gesture_GetCurrentDisplayGesture(&gesture_detector);
       if (current_gesture != GESTURE_NONE) {
         UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_YELLOW); // Highlight detected gesture
         UTIL_LCDEx_PrintfAt(0, LINE(24), RIGHT_MODE, "GESTURE: %s", Gesture_GetName(current_gesture));
         UTIL_LCD_SetTextColor(UTIL_LCD_COLOR_WHITE);  // Reset to white
       } else {
         UTIL_LCDEx_PrintfAt(0, LINE(24), RIGHT_MODE, "Gesture: %s", Gesture_GetName(current_gesture));
       }


    UTIL_LCD_SetFont(&Font20); // Reset to normal font
    UTIL_LCD_SetBackColor(0);

    // Update LCD
    SCB_CleanDCache_by_Addr(lcd_fg_buffer[lcd_fg_buffer_rd_idx], LCD_FG_FRAMEBUFFER_SIZE);
    ret = HAL_LTDC_ReloadLayer(&hlcd_ltdc, LTDC_RELOAD_VERTICAL_BLANKING, LTDC_LAYER_2);
    assert(ret == HAL_OK);
    lcd_fg_buffer_rd_idx = 1 - lcd_fg_buffer_rd_idx;
}


/**
 * @brief Displays a Welcome screen
 */
static void Display_WelcomeScreen(void)
{
  static uint32_t t0 = 0;
  if (t0 == 0)
    t0 = HAL_GetTick();

